Repository: perlancar/perl-Perinci-Sub-Gen-AccessTable
Catalog: po/*.po
Languages: id

source: field selection
id: pemilihan field

source: Return field names in each record (as hash/associative array)
id: Sertakan nama field di tiap rekord (sebagai larik asosiatif/hash)

source: When enabled, function will return each record as hash/associative array (field name => value pairs). Otherwise, function will return each record as list/array (field value, field value, ...).
id: Jika opsi ini aktif, fungsi akan mengembalikan tiap rekord sebagai larik asosiatif/hash (pasangan nama field => nilai field). Tanpa opsi ini, fungsi akan mengembalikan tiap rekord sebagai larik/list (nilai field, nilai ...).

source: Return array of full records instead of just ID fields
id: Kembalikan daftar record dan tidak hanya daftar nilai field kunci

source: By default, only the key (ID) field is returned per result entry.
id: Defaultnya, hanya field kunci (ID) yang dikembalikan per entri hasil.

source: Select fields to return
id: Pilih field yang ingin dikembalikan

source: ordering
id: pengurutan

source: Order records according to certain field(s)
id: Urutkan rekord berdasarkan field(-field) tertentu

source: A list of field names separated by comma. Each field can be prefixed with '-' to specify descending order instead of the default ascending.
id: Daftar nama field dipisahkan oleh koma. Setiap field dapat diawali '-' untuk menyatakan ingin pengurutan dari besar ke kecil (default dari kecil ke besar).

source: Return records in random order
id: Kembalikan rekord dalam urutan acak

source: paging
id: halaman

source: Only return a certain number of records
id: Hanya kembalikan sejumlah tertentu rekord

source: Only return starting from the n'th record
id: Hanya kembalikan mulai dari rekord posisi ke-n

source: filtering
id: penyaringan

source: Search
id: Cari

source: Show field '{field}'
id: Tampilkan field '{field}'

source: filtering for {field}
id: penyaringan untuk {field}

source: Only return records where the '{field}' field equals specified value
id: Hanya kembalikan rekord yang field '{field}'-nya bernilai tertentu

source: Only return records where the '{field}' field does not equal specified value
id: Hanya kembalikan rekord yang field '{field}'-nya tidak sama dengan nilai tertentu

source: Only return records where the '{field}' field is in the specified values
id: Hanya kembalikan rekord yang field '{field}'-nya salah satu dari nilai-nilai yang disebutkan

source: Only return records where the '{field}' field is not in the specified values
id: Hanya kembalikan rekord yang field '{field}'-nya bukan salah satu dari nilai-nilai yang disebutkan

source: Only return records where the '{field}' field is an array/list which contains specified value
id: Hanya kembalikan rekord yang field '{field}'-nya adalah larik yang mengandung nilai tertentu

source: Only return records where the '{field}' field is an array/list which does not contain specified value
id: Hanya kembalikan rekord yang field '{field}'-nya adalah larik yang tidak mengandung nilai tertentu

source: Only return records where the '{field}' field is greater than or equal to specified value
id: Hanya kembalikan rekord yang field '{field}'-nya lebih besar atau sama dengan nilai tertentu

source: Only return records where the '{field}' field is less than or equal to specified value
id: Hanya kembalikan rekord yang field '{field}'-nya lebih kecil atau sama dengan nilai tertentu

source: Only return records where the '{field}' field is greater than specified value
id: Hanya kembalikan rekord yang field '{field}'-nya lebih besar dari nilai tertentu

source: Only return records where the '{field}' field is less than specified value
id: Hanya kembalikan rekord yang field '{field}'-nya lebih kecil dari nilai tertentu

source: Only return records where the '{field}' field contains specified text
id: Hanya kembalikan rekord yang field '{field}'-nya mengandung teks tertentu

source: Only return records where the '{field}' field does not contain specified text
id: Hanya kembalikan rekord yang field '{field}'-nya tidak mengandung teks tertentu

source: Only return records where the '{field}' field matches specified regular expression pattern
id: Hanya kembalikan rekord yang field '{field}'-nya cocok dengan pola regex tertentu

source: Only return records where the '{field}' field does not match specified regular expression
id: Hanya kembalikan rekord yang field '{field}'-nya tidak cocok dengan pola regex tertentu
